# BaseOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..BaseOffset Property
Form Class See Also
---
Retrieve/set the base offset of the form object. It is only valid for locked form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double BaseOffset { get; set; }
```

Visual Basic
---
```text
Public Property BaseOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when this is not a locked form. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the value is invalid. |
| Autodesk.Revit.Exceptions..::..ApplicationException | Thrown when it fail to get/set BaseOffset. |

# See Also
Form Class
Autodesk.Revit.DB Namespace